{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence listing Valentine-related features, associated files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Text summaries of major frontend files describing Valentine page components and behavior.",
  "frontend/index.css": "Tailwind base styles and Valentine-themed color variables with light/dark mode.",
  "frontend/index.html": "HTML entry point setting title, meta description, and mounting root.",
  "frontend/src/App.tsx": "App component rendering the AhanaValentinePage by default.",
  "frontend/src/components/avatar/AnimeGirlScene.tsx": "Renders a 3D anime girl with various animated emotional states using three.js and react-three-fiber.",
  "frontend/src/components/avatar/AvatarViewport.tsx": "Wraps the 3D avatar canvas, handles WebGL support checks, and shows a loading fallback.",
  "frontend/src/components/companion/ChatComposer.tsx": "Provides a text input and send button for composing and submitting chat messages.",
  "frontend/src/components/companion/TranscriptPanel.tsx": "Displays a scrollable chat transcript with user and assistant messages and emotion indicators.",
  "frontend/src/components/companion/VoiceControls.tsx": "Controls speech recognition, language selection, and mute state with status alerts.",
  "frontend/src/components/ConfettiBurst.tsx": "Confetti animation component with reduced‑motion fallback emoji.",
  "frontend/src/components/CuteParticles.tsx": "Sparkle particle overlay with randomized positions and reduced‑motion support.",
  "frontend/src/components/FloatingHearts.tsx": "Floating hearts animation with randomized motion and reduced‑motion handling.",
  "frontend/src/components/ProposalStepFlow.tsx": "Multi‑step proposal interaction culminating in acceptance and celebration UI.",
  "frontend/src/components/SimpleProposalMoment.tsx": "Lightweight proposal interaction with playful moving ‘No’ button and confetti on ‘Yes’.",
  "frontend/src/components/SurpriseReveal.tsx": "Displays a card with a hidden love message that reveals after clicking a button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing when identity changes.",
  "frontend/src/hooks/useAvatarAnimationState.ts": "Manages the current animation state for the avatar with simple state setters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Tracks the user's prefers-reduced-motion setting via matchMedia and updates reactively.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements speech-to-text handling with interim/final results, error states, and start/stop controls.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Provides text-to-speech with voice selection, language options, mute state, and speaking status tracking.",
  "frontend/src/index.css": "Global Tailwind-based styling with Valentine themes and color variables for light/dark modes.",
  "frontend/src/lib/scriptedConversation/respond.ts": "Chooses a response by matching user input against prioritized conversation rules or fallback lines.",
  "frontend/src/lib/scriptedConversation/rules.ts": "Defines keyword-based scripted conversation rules with priorities and emotion-tagged responses.",
  "frontend/src/lib/scriptedConversation/types.ts": "Defines conversation-related types including emotions, messages, and response structure.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AhanaProposalPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AhanaValentinePage.tsx": "Valentine-themed page with switchable themes, animations, hero section, and proposal flow elements.",
  "frontend/src/pages/VoiceCompanionPage.tsx": "React page implementing the Isabella voice companion UI, managing speech recognition, speech synthesis, avatar animations, and chat message flow. It handles user input, generates assistant responses, and renders avatar, controls, and transcript components.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, and enabling plugins for typography, container queries, and animations. It sets up a large set of custom OKLCH-based color tokens for the app’s design system.",
  "project_state.json": "Project state metadata describing a Valentine-themed website with features, requirements, and version info. Lists multiple feature definitions focused on visuals, theming, animations, and interactive Valentine flows."
}