{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping proposal features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file listing short descriptions of various frontend components and pages.",
  "frontend/index.css": "Tailwind base styles defining color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point loading the React app for Suvo’s proposal to Ahana.",
  "frontend/src/App.tsx": "Root component rendering the AhanaProposalPage.",
  "frontend/src/components/ConfettiBurst.tsx": "Generates temporary animated confetti respecting reduced‑motion settings.",
  "frontend/src/components/CuteParticles.tsx": "Floating heart and sparkle particle effect with reduced‑motion support.",
  "frontend/src/components/FloatingHearts.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProposalStepFlow.tsx": "Empty placeholder component file.",
  "frontend/src/components/SimpleProposalMoment.tsx": "Two‑step proposal interaction with celebration state and confetti.",
  "frontend/src/components/SurpriseReveal.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing a backend actor based on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing login, stored identities, and AuthClient setup.",
  "frontend/src/index.css": "Defines global Tailwind layers, custom OKLCH theme variables for light/dark modes, fonts, and utility animations like floating particles and gentle float.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider, and loads global styles.",
  "frontend/src/pages/AhanaProposalPage.tsx": "Renders a multi-section romantic proposal page with themed gradients, photos, particles, and a SimpleProposalMoment component.",
  "frontend/src/pages/AhanaValentinePage.tsx": "Empty placeholder page file for a Valentine-themed view.",
  "frontend/tailwind.config.js": "Configures Tailwind with plugins, custom OKLCH color tokens, container settings, and extended theme values.",
  "project_state.json": "Captures project metadata, requirements, design notes, and feature tracking for building a personalized Valentine proposal site."
}