{
  "kind": "build_request",
  "title": "Convert Ahana Valentine proposal site to simple cute text-only page (no photos)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Remove all photo usage from the current single-page site and make the Valentine/proposal experience completely text-only (do not display any uploaded images, including IMG_5979.jpeg, and remove all <img> references such as /assets/photos/IMG_3752.jpeg and /assets/photos/IMG_3753.jpeg).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "No pics",
          "No photos just simple like our first web cute",
          "Build it now"
        ]
      },
      "acceptanceCriteria": [
        "The page renders with zero photo/image sections intended as photos (no couple photos, no hero photo).",
        "No code in the rendered page references /assets/photos/IMG_3752.jpeg or /assets/photos/IMG_3753.jpeg.",
        "The uploaded image IMG_5979.jpeg is not referenced or displayed anywhere in the UI."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Ensure the app renders a simple, cute, Valentine-themed single-page message for Ahana that is clearly from Suvo, keeping all user-facing text in English and aligning the layout/content with the earlier ‘first web’ Valentine style (hero + short love note/letter + reasons list + closing CTA).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make a simple proposal web for my gf ahana for velentine like first web",
          "No photos just simple like our first web cute"
        ]
      },
      "acceptanceCriteria": [
        "The page includes: (1) a hero section addressed to Ahana, (2) a short love note/letter signed by Suvo, (3) a static ‘reasons’ list, and (4) a closing Valentine CTA section.",
        "All visible text is in English and clearly indicates it is for Ahana and from Suvo.",
        "No photo placeholders or empty photo blocks remain in the layout."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Update the closing interaction copy to be Valentine-focused (e.g., “Ahana, will you be my Valentine?”) and keep the interaction simple (single-step or at most two steps) with an optional lightweight celebration effect that respects prefers-reduced-motion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "simple like our first web cute",
          "velentine"
        ]
      },
      "acceptanceCriteria": [
        "The CTA prompt asks Ahana to be the user’s Valentine (not ‘girlfriend’ unless explicitly included as secondary copy).",
        "The interaction completes in one step (or two steps maximum) and ends in a celebratory ‘Yes’ outcome addressed to Ahana and attributed to Suvo.",
        "If celebration animation (e.g., confetti) runs, it does not run when prefers-reduced-motion is enabled."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add or require authentication for this page.",
    "Do not add backend functionality; backend/main.mo must remain unchanged unless strictly necessary.",
    "All user-facing text must be in English.",
    "The site must be text-only (no photos)."
  ],
  "nonGoals": [
    "Creating a new separate ‘introduction website’ or implementing the earlier red/black egotistic theme.",
    "Displaying or incorporating the uploaded image IMG_5979.jpeg anywhere on the site.",
    "Adding any database or external service integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}