{
  "kind": "build_request",
  "title": "Build a brand-new simple cute proposal page using the best 2 uploaded photos",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Replace the current proposal page UI with a brand-new, simple, cute single-page proposal experience addressed to “Ahana” and clearly from “Suvo”, with minimal sections (hero + short message + photos + proposal moment) and all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yup brand new cute simple proposal web and use these pics and make it special cute"
        ]
      },
      "acceptanceCriteria": [
        "The app renders a single-page proposal experience that is visibly simpler than the current multi-section page (no long story/reasons/surprise sections unless explicitly kept minimal).",
        "All visible text is in English and clearly indicates it is from Suvo to Ahana.",
        "The page is responsive across mobile and desktop and maintains a cute, warm aesthetic (avoid a blue/purple primary palette)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Incorporate the user’s uploaded photos into the new page by selecting the best 2 unique images from: IMG_3752.jpeg, IMG_3753.jpeg, IMG_3752-1.jpeg, IMG_3753-1.jpeg; add the chosen 2 as static frontend assets and render them on the page (e.g., one primary hero photo + one secondary photo section).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yup just make it cute and use 2 photos they are similar so chose the better 2"
        ]
      },
      "acceptanceCriteria": [
        "Exactly two of the four uploaded images are used on the page (the best-looking two unique photos are selected).",
        "The selected photos are stored as static assets in the frontend (not served via the backend) and are referenced by their filenames.",
        "Images are displayed responsively with sensible cropping (object-fit) and include non-identifying, descriptive alt text (e.g., “A cozy couple photo”)."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Implement a simple, cute proposal interaction at the end of the page (single-step or at most two steps) that culminates in a celebratory “Yes” outcome for Ahana, signed/attributed to Suvo, and optionally triggers a lightweight celebration effect that respects prefers-reduced-motion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make the web now",
          "Build it"
        ]
      },
      "acceptanceCriteria": [
        "The proposal interaction is simpler than the existing multi-step flow (no more than two steps).",
        "On “Yes”, the UI shows a clear celebration message addressed to Ahana and attributed to Suvo.",
        "If any animation is used (e.g., confetti/particles), it is disabled/reduced when prefers-reduced-motion is enabled."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not modify any immutable frontend hook/bootstrap paths listed in SYSTEM_CONTEXT.",
    "Do not introduce backend changes; keep backend/main.mo as-is and do not add persistence or authentication requirements.",
    "Do not serve images via the backend; use static frontend assets.",
    "All user-facing text must be English."
  ],
  "nonGoals": [
    "Adding Internet Identity login/logout or any authentication flow.",
    "Adding a database or storing proposal responses server-side.",
    "Building multi-page routing; keep it a single-page experience.",
    "Integrating third-party services or APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}