{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simple cute single-page proposal for Ahana (from Suvo) with 2 photos",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Replace the current proposal page with a brand-new simple, cute single-page experience addressed to Ahana and from Suvo (English only), with minimal sections and a warm aesthetic.",
      "acceptanceCriteria": [
        "The app renders a single-page proposal experience that is visibly simpler than the current multi-section page (no long story/reasons/surprise sections unless explicitly kept minimal).",
        "All visible text is in English and clearly indicates it is from Suvo to Ahana.",
        "The page is responsive across mobile and desktop and maintains a cute, warm aesthetic (avoid a blue/purple primary palette)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AhanaProposalPage.tsx",
          "operation": "modify",
          "description": "Rewrite the page layout to a minimal, single-page structure (hero + short message + photos + proposal moment), removing the long story/reasons/surprise sections; keep a cute, warm tone and ensure all visible copy is English and clearly from “Suvo” to “Ahana”. Use shadcn-ui components (e.g., Card, Button) for consistent styling; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the document title/description to match the new simple proposal wording (English), clearly indicating it is from Suvo to Ahana."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure global styling supports a cute, warm aesthetic and responsive typography/spacing for the simplified page (avoid blue/purple emphasis); keep reduced-motion considerations intact."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Select and add exactly two best unique uploaded photos as static frontend assets and render them responsively with descriptive non-identifying alt text.",
      "acceptanceCriteria": [
        "Exactly two of the four uploaded images are used on the page (the best-looking two unique photos are selected).",
        "The selected photos are stored as static assets in the frontend (not served via the backend) and are referenced by their filenames.",
        "Images are displayed responsively with sensible cropping (object-fit) and include non-identifying, descriptive alt text (e.g., “A cozy couple photo”)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/photos/IMG_3752.jpeg",
          "operation": "create",
          "description": "Add the selected primary photo as a static frontend asset (chosen as one of the best two unique images) to be referenced by filename."
        },
        {
          "path": "frontend/public/assets/photos/IMG_3753.jpeg",
          "operation": "create",
          "description": "Add the selected secondary photo as a static frontend asset (chosen as one of the best two unique images) to be referenced by filename."
        },
        {
          "path": "frontend/src/pages/AhanaProposalPage.tsx",
          "operation": "modify",
          "description": "Render exactly two photos (hero and secondary) using the static asset filenames (frontend/public/assets/photos/IMG_3752.jpeg and frontend/public/assets/photos/IMG_3753.jpeg), with responsive sizing and sensible cropping (object-fit), plus non-identifying descriptive alt text."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Implement a simple (<=2-step) cute proposal interaction that ends in a celebratory Yes outcome for Ahana, attributed to Suvo, with optional reduced-motion-friendly celebration.",
      "acceptanceCriteria": [
        "The proposal interaction is simpler than the existing multi-step flow (no more than two steps).",
        "On “Yes”, the UI shows a clear celebration message addressed to Ahana and attributed to Suvo.",
        "If any animation is used (e.g., confetti/particles), it is disabled/reduced when prefers-reduced-motion is enabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SimpleProposalMoment.tsx",
          "operation": "create",
          "description": "Create a minimal proposal interaction component with at most two states (ask → yes celebration), culminating in a clear “Yes” outcome addressed to Ahana and signed/attributed to Suvo. Use shadcn-ui components (e.g., Card, Button) for the interaction UI; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ConfettiBurst.tsx",
          "operation": "modify",
          "description": "Ensure the celebration effect remains lightweight and continues to respect prefers-reduced-motion (no confetti rendered when reduced motion is enabled)."
        },
        {
          "path": "frontend/src/pages/AhanaProposalPage.tsx",
          "operation": "modify",
          "description": "Wire the new SimpleProposalMoment component into the end of the single-page experience and remove/avoid usage of the existing multi-step proposal flow to keep the interaction to <=2 steps; Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}