{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Text-only cute Valentine single-page for Ahana (from Suvo)",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Remove all photo usage and eliminate any <img> references so the page is fully text-only.",
      "acceptanceCriteria": [
        "The page renders with zero photo/image sections intended as photos (no couple photos, no hero photo).",
        "No code in the rendered page references /assets/photos/IMG_3752.jpeg or /assets/photos/IMG_3753.jpeg.",
        "The uploaded image IMG_5979.jpeg is not referenced or displayed anywhere in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AhanaProposalPage.tsx",
          "operation": "modify",
          "description": "Remove hero/message photo blocks and delete all <img> tags referencing /assets/photos/IMG_3752.jpeg and /assets/photos/IMG_3753.jpeg; ensure the layout has no photo placeholders or empty photo containers."
        },
        {
          "path": "frontend/src/components/CuteParticles.tsx",
          "operation": "modify",
          "description": "Remove the <img> usage for sparkles (/assets/generated/sparkle-particles.dim_256x256.png) and replace it with text-only characters (e.g., ✨) while keeping prefers-reduced-motion behavior intact."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Render a simple, cute, Valentine-themed single-page message in English with hero, love note, reasons list, and closing CTA (for Ahana, from Suvo).",
      "acceptanceCriteria": [
        "The page includes: (1) a hero section addressed to Ahana, (2) a short love note/letter signed by Suvo, (3) a static ‘reasons’ list, and (4) a closing Valentine CTA section.",
        "All visible text is in English and clearly indicates it is for Ahana and from Suvo.",
        "No photo placeholders or empty photo blocks remain in the layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AhanaProposalPage.tsx",
          "operation": "modify",
          "description": "Rewrite the single-page content to match the requested 'first web' style structure (hero + short love note/letter + reasons list + closing CTA), ensuring all user-facing text is English, addressed to Ahana, and clearly from Suvo; keep the page as a single scrollable view."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Update the closing interaction to be Valentine-focused with a simple 1–2 step flow and optional celebration respecting prefers-reduced-motion.",
      "acceptanceCriteria": [
        "The CTA prompt asks Ahana to be the user’s Valentine (not ‘girlfriend’ unless explicitly included as secondary copy).",
        "The interaction completes in one step (or two steps maximum) and ends in a celebratory ‘Yes’ outcome addressed to Ahana and attributed to Suvo.",
        "If celebration animation (e.g., confetti) runs, it does not run when prefers-reduced-motion is enabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SimpleProposalMoment.tsx",
          "operation": "modify",
          "description": "Update the primary CTA copy to Valentine-focused wording (e.g., 'Ahana, will you be my Valentine?') and adjust the celebration step copy so it is addressed to Ahana and clearly from Suvo; keep the interaction at 1 step (or max 2) and continue using the existing reduced-motion-safe celebration behavior. Use shadcn-ui components (Card, Button) for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AhanaProposalPage.tsx",
          "operation": "modify",
          "description": "Ensure the closing CTA section uses the updated Valentine interaction component and does not include any extra steps beyond the defined flow; keep surrounding copy Valentine-themed and text-only."
        }
      ]
    }
  ]
}